package practiki.prac_13_14;

/*
Задание 1. (20%)Написать программу, выводящую фамилию разработчика, дату и время получения задания, а также
дату и время сдачи задания. Для получения последней даты и времени использовать класс Date из пакета
java.util.* (Объявление Dated=newDate() или метод System.currentTimeMillis().
Задание 2. (20%)
Приложение, сравнивающее текущую дату и дату, введенную пользователем c текущим системным
временем
Задание 3. (20%)
Доработайте класс Student предусмотрите поле для хранения даты рождения, перепишите метод
toString() таким образом, чтобы он разработайте метод, возвращал строковое представление даты рождения
по вводимому в метод формату даты (например, короткий, средний и полный формат даты).
Задание 4. (10%)
Напишите пользовательский код, который формирует объекты Date и Calendar по следующим
данным, вводимым пользователем:
<Год><Месяц><Число>
<Часы1><минуты>
Задание 5 (30%)
Сравнить время выполнения кода в реализации кода в виде различных структур данных из
предыдущих заданий (сравнить ArrayList и LinkedList по производительности – операции вставки,
удаления, добавления и поиска по образцу)
 */
public class Main {
    public static void main(String[] args) {

    }
}
